tap "dart-lang/dart"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "sass/sass"
tap "surrealdb/tap"
tap "tbckr/tap"
brew "libtiff"
brew "webp"
brew "jpeg-xl"
brew "openssl@3"
brew "autoconf"
brew "automake"
brew "sqlite"
brew "python@3.11"
brew "awscli"
brew "azure-cli"
brew "biber"
brew "btop"
brew "gettext"
brew "python@3.12"
brew "cmake"
brew "libtool"
brew "php"
brew "composer"
brew "coreutils"
brew "docker"
brew "docker-compose"
brew "emacs"
brew "exa"
brew "fastfetch"
brew "feh"
brew "leptonica"
brew "tesseract"
brew "ffmpeg"
brew "gh"
brew "ghc"
brew "ghcup"
brew "git"
brew "git-lfs"
brew "gnu-sed"
brew "go"
brew "gptline"
brew "graphviz"
brew "htop"
brew "hub"
brew "hugo"
brew "imagemagick"
brew "libksba"
brew "lpeg"
brew "luarocks"
brew "lynx"
brew "make"
brew "md5sha1sum", link: false
brew "node"
brew "mongosh"
brew "mongodb-atlas-cli"
brew "mysql", restart_service: true
brew "mysql-client"
brew "neovim"
brew "ninja"
brew "nsnake"
brew "openjdk"
brew "openssl@1.1"
brew "pandoc"
brew "pandoc-crossref"
brew "pdftk-java"
brew "pkg-config"
brew "postgresql@14"
brew "postgresql@16"
brew "python@3.10"
brew "python@3.9"
brew "r"
brew "ripgrep"
brew "rust"
brew "speedtest-cli"
brew "spotify-tui"
brew "thefuck"
brew "tmux"
brew "vim"
brew "watch"
brew "wget"
brew "yarn"
brew "yq"
brew "sass/sass/sass"
brew "surrealdb/tap/surreal"
brew "tbckr/tap/sgpt"
cask "amethyst"
cask "anaconda"
cask "anki"
cask "discord"
cask "firefox"
cask "fluent-reader"
cask "font-hack-nerd-font"
cask "gimp"
cask "github"
cask "inkscape"
cask "iterm2"
cask "kitty"
cask "libreoffice"
cask "linearmouse"
cask "maccy"
cask "mactex"
cask "microsoft-auto-update"
cask "microsoft-excel"
cask "microsoft-outlook"
cask "microsoft-powerpoint"
cask "microsoft-teams"
cask "microsoft-word"
cask "minecraft"
cask "miniconda"
cask "quarto"
cask "rstudio"
cask "sioyek"
cask "slack"
cask "steam"
cask "tex-live-utility"
cask "xquartz"
cask "zed"
cask "zoom"
cask "zotero"
