tap "dart-lang/dart"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "sass/sass"
tap "surrealdb/tap"
tap "tbckr/tap"
brew "libtiff"
brew "webp"
brew "jpeg-xl"
brew "openssl@3"
brew "autoconf"
brew "automake"
brew "sqlite"
brew "python@3.11"
brew "awscli"
brew "azure-cli"
brew "biber"
brew "btop"
brew "gettext"
brew "python@3.12"
brew "cmake"
brew "libtool"
brew "php"
brew "composer"
brew "coreutils"
brew "docker"
brew "docker-compose"
brew "emacs"
brew "exa"
brew "fastfetch"
brew "feh"
brew "leptonica"
brew "tesseract"
brew "ffmpeg"
brew "gh"
brew "ghc"
brew "ghcup"
brew "git"
brew "git-lfs"
brew "gnu-sed"
brew "go"
brew "gptline"
brew "graphviz"
brew "htop"
brew "hub"
brew "hugo"
brew "imagemagick"
brew "libksba"
brew "lpeg"
brew "luarocks"
brew "lynx"
brew "make"
brew "md5sha1sum", link: false
brew "node"
brew "mongosh"
brew "mongodb-atlas-cli"
brew "mysql", restart_service: true
brew "mysql-client"
brew "neovim"
brew "ninja"
brew "nsnake"
brew "openjdk"
brew "openssl@1.1"
brew "pandoc"
brew "pandoc-crossref"
brew "pdftk-java"
brew "pkg-config"
brew "postgresql@14"
brew "postgresql@16"
brew "python@3.10"
brew "python@3.9"
brew "r"
brew "ripgrep"
brew "rust"
brew "speedtest-cli"
brew "spotify-tui"
brew "thefuck"
brew "tmux"
brew "vim"
brew "watch"
brew "wget"
brew "yarn"
brew "yq"
brew "sass/sass/sass"
brew "surrealdb/tap/surreal"
brew "tbckr/tap/sgpt"
cask "amethyst"
cask "anaconda"
cask "anki"
cask "discord"
cask "firefox"
cask "fluent-reader"
cask "font-hack-nerd-font"
cask "gimp"
cask "github"
cask "inkscape"
cask "iterm2"
cask "kitty"
cask "libreoffice"
cask "linearmouse"
cask "maccy"
cask "mactex"
cask "microsoft-auto-update"
cask "microsoft-excel"
cask "microsoft-outlook"
cask "microsoft-powerpoint"
cask "microsoft-teams"
cask "microsoft-word"
cask "minecraft"
cask "miniconda"
cask "quarto"
cask "rstudio"
cask "sioyek"
cask "slack"
cask "steam"
cask "tex-live-utility"
cask "visual-studio-code"
cask "xquartz"
cask "zed"
cask "zoom"
cask "zotero"
vscode "ahmadawais.shades-of-purple"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "analytic-signal.preview-tiff"
vscode "atlassian.atlascode"
vscode "bierner.markdown-emoji"
vscode "bierner.markdown-mermaid"
vscode "britany.dark-cyberpunk-aesthetic"
vscode "chrischinchilla.vscode-pandoc"
vscode "davidanson.vscode-markdownlint"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "enkia.tokyo-night"
vscode "eriklynd.json-tools"
vscode "extr0py.vscode-relative-line-numbers"
vscode "foam.foam-vscode"
vscode "freecodecamp.freecodecamp-courses"
vscode "george-alisson.html-preview-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "haskell.haskell"
vscode "james-yu.latex-workshop"
vscode "johnpapa.vscode-peacock"
vscode "justusadam.language-haskell"
vscode "kzvi.pandoc-markdown-preview"
vscode "maltehei.latex-citations"
vscode "marp-team.marp-vscode"
vscode "mechatroner.rainbow-csv"
vscode "mikeylau.typewriter-auto-scroll"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-hub"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.live-server"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.wordcount"
vscode "niklaspor.biblatex-snippets"
vscode "njpwerner.autodocstring"
vscode "notzaki.pandocciter"
vscode "pnp.polacode"
vscode "quarto.quarto"
vscode "qwtel.sqlite-viewer"
vscode "randomfractalsinc.geo-data-viewer"
vscode "raymondcamden.languagetool"
vscode "rdebugger.r-debugger"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "reditorsupport.r"
vscode "robole.markdown-snippets"
vscode "somekittens.hot-dog-stand"
vscode "sumneko.lua"
vscode "syler.sass-indented"
vscode "tamasfe.even-better-toml"
vscode "tarik02.absolutely-black"
vscode "techer.open-in-browser"
vscode "tomoki1207.pdf"
vscode "twxs.cmake"
vscode "unifiedjs.vscode-mdx"
vscode "valentjn.vscode-ltex"
vscode "vscodevim.vim"
vscode "wraith13.unsaved-files-vscode"
vscode "yzane.markdown-pdf"
vscode "yzhang.markdown-all-in-one"
vscode "zainchen.json"
