tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "surrealdb/tap"
tap "tbckr/tap"
brew "libtiff"
brew "webp"
brew "jpeg-xl"
brew "openssl@3"
brew "autoconf"
brew "automake"
brew "python@3.10"
brew "azure-cli"
brew "gettext"
brew "cmake"
brew "coreutils", link: false
brew "docker"
brew "emacs"
brew "exa"
brew "leptonica"
brew "tesseract"
brew "ffmpeg"
brew "libtool"
brew "ghc"
brew "ghcup"
brew "git"
brew "git-lfs"
brew "go"
brew "htop"
brew "hub"
brew "hugo"
brew "libksba"
brew "python@3.11"
brew "lpeg"
brew "md5sha1sum"
brew "node"
brew "mongosh"
brew "mongodb-atlas-cli"
brew "mysql", restart_service: true
brew "mysql-client"
brew "neovim"
brew "ninja"
brew "node@16"
brew "openjdk"
brew "openssl@1.1"
brew "pandoc"
brew "pandoc-crossref"
brew "pdftk-java"
brew "php"
brew "postgresql@14"
brew "postgresql@16"
brew "python@3.9"
brew "r"
brew "rust"
brew "speedtest-cli"
brew "spotify-tui"
brew "thefuck"
brew "vim"
brew "wget"
brew "surrealdb/tap/surreal"
brew "tbckr/tap/sgpt"
cask "anaconda"
cask "discord"
cask "dozer"
cask "element"
cask "fluent-reader"
cask "font-hack-nerd-font"
cask "gimp"
cask "github"
cask "iterm2"
cask "jabref"
cask "kicad"
cask "libreoffice"
cask "linearmouse"
cask "maccy"
cask "mactex"
cask "miniconda"
cask "pgadmin4"
cask "quarto"
cask "rectangle"
cask "rstudio"
cask "slack"
cask "visual-studio-code"
cask "wkhtmltopdf"
cask "zettlr"
cask "zotero"
vscode "A-WS-M.zotenote"
vscode "alten-din-sophia.din-zoteronotes"
vscode "bierner.markdown-emoji"
vscode "bierner.markdown-mermaid"
vscode "ChrisChinchilla.vscode-pandoc"
vscode "DavidAnson.vscode-markdownlint"
vscode "eamodio.gitlens"
vscode "eriklynd.json-tools"
vscode "foam.foam-vscode"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "GitHub.copilot-labs"
vscode "haskell.haskell"
vscode "James-Yu.latex-workshop"
vscode "johnpapa.vscode-peacock"
vscode "justusadam.language-haskell"
vscode "kzvi.pandoc-markdown-preview"
vscode "maltehei.latex-citations"
vscode "marp-team.marp-vscode"
vscode "mathematic.vscode-latex"
vscode "mechatroner.rainbow-csv"
vscode "MikeyLau.typewriter-auto-scroll"
vscode "mjpvs.latex-previewer"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.wordcount"
vscode "niklaspor.biblatex-snippets"
vscode "njpwerner.autodocstring"
vscode "notZaki.pandocciter"
vscode "quarto.quarto"
vscode "raymondcamden.languagetool"
vscode "redhat.vscode-yaml"
vscode "robole.markdown-snippets"
vscode "tarik02.absolutely-black"
vscode "tomoki1207.pdf"
vscode "valentjn.vscode-ltex"
vscode "vscodevim.vim"
vscode "wraith13.unsaved-files-vscode"
vscode "yzane.markdown-pdf"
vscode "yzhang.markdown-all-in-one"
